[{"id": 21, "title": "INTRODUCTION", "description": "The portal, www.fittingswale.com (“Website”) and the mobile application ‘fittingswale’ (“App”) (collectively “Platforms”) is managed and operated by Mittal enterprises (“fittingswale” or “We”), a proprietorship firm with its registered office located at mittal bhawan gol building manaitand dhanbad Jharkhand – 826001 India. Fittingswale is inter alia engaged in the business of wholesale and retail trade in home improvement sector and sale of their allied and auxiliary products (“Products”), through brick and mortar stores and through its Platforms and providing other home design and decor solutions (collectively as “Services”) to the users of the Platforms (“User” or “You” or “Your”)"}, {"id": 22, "title": "OBJECTIVES OF THIS POLICY", "description": "2.1. In keeping with fittingswale goal of ensuring User satisfaction, this cancellation, return and refund policy (“Cancellation, Return and Refund Policy”), together with the terms of use at www.fittingswale.com , sets out fittingswale procedures and policies in accepting: (a) Product cancellations before the Product is delivered to a User; or (b) Product returns, once a Product has been delivered to a User after purchase from the Platforms. Any return or cancellation of Products by Users shall be governed by and subject to the terms and conditions set out under this Cancellation, Return and Refund Policy. | 2.2. Users are required to peruse and understand the terms of this Cancellation, Return and Refund Policy. If you do not agree to the terms contained in this Cancellation, Return and Refund Policy, You are advised not to accept the terms of use and may forthwith leave and stop using the Platforms. The terms contained in this Cancellation, Return and Refund Policy shall be accepted without modification and You agree to be bound by the terms contained herein by initiating a request for purchase of Product(s) on the Platforms. | Cancellations | Fittingswale is committed to ensuring the timely delivery of your orders. If, however, you have mistakenly ordered the wrong product, you may request a cancellation through your Fittingswale Account.Refunds will be processed in accordance with our Refund Policy. Please be aware that cancellation requests cannot be accommodated once an order has been dispatched. | Step to Follow | Login to your Fittingswale account | Login --> My Order --> Select Reason --> Cancel Order | Please Note: | ·We will initiate the refund process in accordance with our Refund Policy. Your understanding and cooperation in this matter are greatly appreciated. | ·Please note that once your order has been dispatched, we are unable to accept cancellation requests. Thank you for your understanding. | Order Cancelations Criteria | Under some rare situations Fittingswale can also raise an order cancellation request. These Situation would be :- | ·Unavailability of Products | ·Incorrect pricing or description of the Products | ·Payment fraud suspicion by our Credit & Fraud avoidance department | ·Non Serviceability of buyer’s address by our Logistics partner ,ETC. | Create an Unboxing Video | Fittingswale is excited to introduce a unique concept that connects buyers directly with brands. To make this experience even better, we kindly request our valued buyers to consider creating an Unboxing Video after receiving their delivery. Your contribution in this regard is highly appreciated, as it allows us to address any unexpected issues with the product at our operational level. Together, we can ensure that you have the best possible experience with us. | Why Consider Creating an Unboxing Video upon Receiving Your Order? | We sincerely encourage our valued customers to contemplate creating an unboxing video when they receive their orders, and here's why it would be truly wonderful: | ·Share the Excitement: Your genuine enthusiasm and initial reactions can serve as a source of inspiration for others and foster excitement about our products. | ·Helpful Insights: Your video can offer invaluable insights for prospective buyers, providing them with a better grasp of the product and its features, aiding in informed decisions. | ·Join the Community: By sharing your unboxing video, you become an integral part of our ever-growing community of satisfied customers. We take immense pleasure in featuring our customers' content on our social media platforms and website. | Returns | We are dedicated to safeguarding our customers' interests, and to ensure your satisfaction, we provide a straightforward and hassle-free product return process, whenever it is necessary. |"}, {"id": 23, "title": "TERMS OF CANCELLATION", "description": "3.1) Cancellation before dispatch | 3.1.1) A User is permitted to fully or partially cancel orders prior to its dispatch from fittingswale. | 3.1.2) The user will be given a unique order ID which can be used by him/her to track the status of the order. | 3.1.3) Prior to the invoicing of the purchased Products, should the User decide to cancel the purchase, the User can do so through App/website in the my order section. | 3.1.4) Refund. In all events of cancellation, prior to the dispatch of the purchased Products, Depo24 shall initiate refunds within 7(seven) business days from the date on which it received the request from the User. | 3.1.5) In case of payment made through prepaid mode through any channel, the refund will be made to the original mode of payment and/or to User’s Fittingswale wallet. All refunds shall be subject to applicable charges as may be deducted by the User’s bank. | 3.2) Cancellation after dispatch. Only accepted in case of (subject to the approval of fittingswale return team after getting the unboxing video of the products) :- | -Wrong product – wrong colour/size/style | -Wrong item Delivered | -Defective products – Manufacturing defect/ Non – functioning (Not applicable, if the product is under Manufacturer warranty) | -Damaged product – Physical damage/Tampered product or packaging | -Wrong Quantities – Missing products/parts | Return/Replacement are not accepted under the following cases: | -Product Alteration or Usage: We are unable to accept returns or replacements for products that have been altered or used. | -Absence of Original Packaging: To process returns or replacements, it is essential that the product is returned in its original packaging, including price tags, labels, accessories, and the original box. | -Tampered Serial Number/Label: If the serial number or label of the product has been tampered with, we cannot proceed with a return or replacement. | -Delay in Reporting Issues: For cases involving damaged, missing, empty packages, or receiving the wrong product, we kindly ask that you report these concerns within 2 days of delivery for us to be able to assist you. | -Promotional/Demand-Based Sales: Products sold under specific promotions or during high-demand periods may not be eligible for return or replacement. | -No Longer Needed/Quality Concerns: Returns or replacements will not be accepted if the product is deemed no longer needed or if the quality does not meet expectations | -Unable to provide the unboxing video:- as we requested to make the unboxing video upon delivery of the product before opening so if such video will not be given then no refund will be accepted. |"}, {"id": 24, "title": "REFUND", "description": "Fittingswale offers easy and quick Refund on your refund Orders. | On certain select days as specified by fittingswale, separate policies may be applicable. | The Products will be picked up within the timelines intimidated by fittingswale. | If a User has purchased Products which form a part of a package of other Products, or if the Product forms a part of a promotional package (collectively, the “Bundled Package”), the User shall be required to return all the Products that form a part of the Bundled Package for fittingswale to process refunds. | Refunds are generally initiated in the following scenarios: | - When Orders are cancelled as per our Cancellation policy | - If our Logistics partner is unable to deliver the product | - If you wish to return the products in accordance with our return policy | Refund gets Declined in the following scenarios: | - Return request is made outside the specified time frame of 2 days. | - If the Product is damaged by the customer, in any manner as may be determined by fittingswale at its sole discretion. | - If the product received by us is not as per claim or missing accessories, label, stickers, etc. | - the serial number / barcode of the Product, as applicable, does not match fittingswale records; | - the accessories delivered with the Product (such as user manuals, etc) are not returned along with the Product, in an undamaged condition | - there are any dents, scratches, tears or any other damage to the Products or any part thereof; | - the gifts accompanying the purchased Product have not been returned, or upon being returned, show signs of being used, washed, or defect; | - Fittingswale is satisfied that the Product has been rendered defective or unusable; | - if the User in any way breaches the Cancellation, Return and Refund Policy; | - the Product has been used, fittingswale shall reserve the right to reject the return of the Product; | In the event a User returns a Product that is not accompanied by the accessories or other items originally bundled with such Product, fittingswale shall have the right, exercisable at its sole discretion, to (i) (a) refuse to accept the return of such Product, or (b) process any refund thereof, or (ii) deduct the amount payable in respect of such items from the amount of refund such User is entitled to. | It is expressly clarified that the refund entitled to by a User shall include monies paid towards shipping charges or any other such charges applicable from time to time. Delivery charges applied on these products shall not be refunded. | In events where fittingswale is unable to facilitate a pick-up of the purchased Product for return from the User, the User is required to self-ship the Product to fittingswale shipping warehouse, the address for which will be intimated to the User upon the User placing such request for return. Upon self-shipping the Product to fittingswale warehouse, the User shall be required to scan the courier/postal receipt to support@fittingswale.com  for fittingswale records. The aforesaid return by self-shipping the Products is subject to the returned Products passing quality check at fittingswale returns desk/warehouse as provided .In the event where the User claims to have self-shipped the Product in accordance with the process set out above and fittingswale does not receive the returned Product or the package containing such Product is empty, the User shall be required to submit the ‘proof of delivery’ received from the courier/postal agency to fittingswale to prove his/her claim of return of Products through self-shipment to fittingswale. It is specifically clarified that any refunds shall be processed by fittingswale only upon receiving the returned Products and concluding required quality checks as provided or receiving the ‘proof of delivery’ from the User, as the case may be. | How Refund process follow: | - Prepaid Orders: Refunds for prepaid orders will be processed through a secure payment gateway or any other online banking/electronic funds transfer system approved by the Reserve Bank of India (RBI) and/or the User’s fittingswale Wallet within such reasonable time (subject to the policies of the User’s bank in case of bank account/credit card refunds) from the date on which fittingswale initiates the refund.. The refunded amount will be credited to the same account from which the transaction was made during the product purchase. | - Cash on Delivery Transactions: In the case of cash on delivery transactions, if a refund is applicable, it will be disbursed via methods such as fittingswale shall process all refunds into either the User’s fittingswale Wallet or demand drafts, NEFT (National Electronic Funds Transfer), or cheques. These will be issued in favour of the customer who made the product purchase, following the details provided by the customer. | Refund Processing Timelines: | After placing a refund request, the amount will be refunded to the customer based on the payment mode chosen by the customer at the time of placing the order. Refunds depend upon the Mode of payment | In case of any Clarification or If you have not received the refund within the stipulated time, kindly contact your banks customer care number to know the status of the transaction. | Any grievances relating to the Cancellation, Return and Refund Policy may be directed by You to support@fittingswale.com."}]